const terms = [
  {
    id: 1,
    name: "HTML",
    description:
      "Cтандартизированный язык разметки документов во Всемирной паутине. Большинство веб-страниц содержат описание разметки на языке HTML (или XHTML). Язык HTML интерпретируется браузерами; полученный в результате интерпретации форматированный текст отображается на экране монитора компьютера или мобильного устройства.",
  },
  {
    id: 2,
    name: "JavaScript",
    description:
      "Мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Является реализацией спецификации ECMAScript. JavaScript обычно используется как встраиваемый язык для программного доступа к объектам приложений. Наиболее широкое применение находит в браузерах как язык сценариев для придания интерактивности веб-страницам.",
  },
  {
    id: 3,
    name: "Server-Side Rendering (SSR)",
    description:
      "Рендеринг на стороне сервера. Рендеринг клиентского или универсального (изоморфного) приложения в HTML на сервере.",
  },
  {
    id: 4,
    name: "Client-Side Rendering (CSR)",
    description:
      "Рендеринг на стороне клиента. Рендеринг приложения в браузере, обычно с использованием DOM.",
  },
  {
    id: 5,
    name: "Static Site Generation (SSG)",
    description:
      "Создание HTML-страницы из шаблонов или компонентов и заданного источника контента на этапе сборки приложения.",
  },
  {
    id: 6,
    name: "Регидратация/гидратация",
    description:
      "«Загрузка» представлений JavaScript на клиенте так, чтобы они повторно использовали дерево DOM и данные HTML, представленные сервером.",
  },
  {
    id: 7,
    name: "React",
    description:
      "Декларативная, эффективная и гибкая JavaScript библиотека для создания пользовательских интерфейсов.",
  },
  {
    id: 8,
    name: "JSX",
    description:
      "JavaScript XML (eXtensible Markup Language). Специальный синтаксис. JSX упрощает написание и добавление HTML-кода в React.",
  },
  {
    id: 9,
    name: "Next.js",
    description:
      "Бесплатный и открытый JavaScript фреймворк, созданный поверх React.js для создания SSR-приложений, созданный компанией Vercel. Помогает создавать пользовательский интерфейс приложений (чаще всего, с помощью React, не придерживаясь его принципа — SPA (Single Page Application)).",
  },
  {
    id: 10,
    name: "Сеть доставки содержимого (Content Delivery Network или Content Distribution Network, CDN)",
    description:
      "Географически распределённая сетевая инфраструктура, позволяющая оптимизировать доставку и дистрибуцию содержимого конечным пользователям в сети Интернет. Использование контент-провайдерами CDN способствует увеличению скорости загрузки интернет-пользователями аудио-, видео-, программного, игрового и других видов цифрового содержимого в точках присутствия сети CDN.",
  },
  {
    id: 11,
    name: "Model-View-Controller (MVC, «Модель-Представление-Контроллер», «Модель-Вид-Контроллер»)",
    description:
      "Схема разделения данных приложения, пользовательского интерфейса и управляющей логики на три отдельных компонента: модель, представление и контроллер — таким образом, что модификация каждого компонента может осуществляться независимо. Модель (Model) предоставляет данные и реагирует на команды контроллера, изменяя своё состояние. Представление (View) отвечает за отображение данных модели пользователю, реагируя на изменения модели. Контроллер (Controller) интерпретирует действия пользователя, оповещая модель о необходимости изменений.",
  },
  {
    id: 12,
    name: "DOM (Document Object Model — «объектная модель документа»)",
    description:
      "Не зависящий от платформы и языка программный интерфейс, позволяющий программам и скриптам получить доступ к содержимому HTML-, XHTML- и XML-документов, а также изменять содержимое, структуру и оформление таких документов.",
  },
  {
    id: 13,
    name: "Виртуальный DOM (VDOM)",
    description:
      "Концепция программирования, в которой идеальное или «виртуальное» представление пользовательского интерфейса хранится в памяти и синхронизируется с «реальным» DOM с помощью библиотеки, такой как ReactDOM. Данный процесс называется согласованием.",
  },
  {
    id: 14,
    name: "API (программный интерфейс приложения) (application programming interface, API)",
    description:
      "Описание способов (набор классов, процедур, функций, структур или констант), которыми одна компьютерная программа может взаимодействовать с другой программой.",
  },
  {
    id: 15,
    name: "Node/Node.js",
    description:
      "Программная платформа, основанная на движке V8 (транслирующем JavaScript в машинный код), превращающая JavaScript из узкоспециализированного языка в язык общего назначения. Node.js добавляет возможность JavaScript взаимодействовать с устройствами ввода-вывода через свой API, написанный на C++, подключать другие внешние библиотеки, написанные на разных языках, обеспечивая вызовы к ним из JavaScript-кода.",
  },
  {
    id: 16,
    name: "Поисковая оптимизация (search engine optimization, SEO)",
    description:
      "Комплекс мероприятий по внутренней и внешней оптимизации для поднятия позиций сайта в результатах выдачи поисковых систем по определённым запросам пользователей, с целью увеличения сетевого трафика (для информационных ресурсов) и потенциальных клиентов (для коммерческих ресурсов) и последующей монетизации (получение дохода) этого трафика.",
  },
];

export default terms;
